Tekla.Structures.Model.FacesAtAnObtuseAngleException
The FacesAtAnObtuseAngleException class represents an error when, faces to be connected are too steep of an angle.

Tekla.Structures.Model.FacesAtAnObtuseAngleException.#ctor
Initializes a new instance of the FacesAtAnObtuseAngleException class with "Faces to be connected are too steep of an angle" error message.